Revit 2026 API

# RebarBendingDetailGetTagRelativePosition Method

---

Gets the embedded tag position w.r.t. the realistic bending detail element in model coordinates.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static XYZ GetTagRelativePosition(
	Element bendingDetail
)
```
```vb
Public Shared Function GetTagRelativePosition (
	bendingDetail As Element
) As XYZ
```
```cpp
public:
static XYZ^ GetTagRelativePosition(
	Element^ bendingDetail
)
```
```fsharp
static member GetTagRelativePosition :
        bendingDetail : Element -> XYZ
```

#### Parameters

bendingDetail Element
     The bending detail element.

#### Return Value

XYZ The new relative position of the embedded tag w.r.t. the bending detail element.

| Exception | Condition |
| --- | --- |
| ArgumentException | This option is only available for realistic bending detail elements. |
| ArgumentNullException | A non-optional argument was null |

This function is exclusive to realistic bending detail mode.

#### Reference

RebarBendingDetail Class

Autodesk.Revit.DB.Structure Namespace